Sorry, i didnt get an error as such, but the plan just did not look correct. So if i try and include the 2nd dynamic block, this is the plan output;
```hcl
# module.qlik_load_balancer.module.load_balancer_https[0].google_compute_url_map.url_map will be updated in-place
  ~ resource "google_compute_url_map" "url_map" {
        id                 = "projects/[REDACTED]/global/urlMaps/load-balancer"
        name               = "load-balancer"
        # (6 unchanged attributes hidden)
      ~ path_matcher {
            name            = "live"
            # (1 unchanged attribute hidden)
          ~ route_rules {
              ~ priority = 1 -> (known after apply)
              ~ service  = "[REDACTED]" -> (known after apply)
              + header_action {
                  + request_headers_to_remove  = (known after apply)
                  + response_headers_to_remove = (known after apply)
                  + request_headers_to_add {
                      + header_name  = (known after apply)
                      + header_value = (known after apply)
                      + replace      = (known after apply)
                    }
                  + response_headers_to_add {
                      + header_name  = (known after apply)
                      + header_value = (known after apply)
                      + replace      = (known after apply)
                    }
                }
              ~ match_rules {
                  + full_path_match = (known after apply)
                  ~ ignore_case     = false -> (known after apply)
                  ~ prefix_match    = "/ss" -> (known after apply)
                  + regex_match     = (known after apply)
                  + header_matches {
                      + exact_match   = (known after apply)
                      + header_name   = (known after apply)
                      + invert_match  = (known after apply)
                      + prefix_match  = (known after apply)
                      + present_match = (known after apply)
                      + regex_match   = (known after apply)
                      + suffix_match  = (known after apply)
                      + range_match {
                          + range_end   = (known after apply)
                          + range_start = (known after apply)
                        }
                    }
                  + metadata_filters {
                      + filter_match_criteria = (known after apply)
                      + filter_labels {
                          + name  = (known after apply)
                          + value = (known after apply)
                        }
                    }
                  + query_parameter_matches {
                      + exact_match   = (known after apply)
                      + name          = (known after apply)
                      + present_match = (known after apply)
                      + regex_match   = (known after apply)
                    }
                }
              + route_action {
                  + cors_policy {
                      + allow_credentials    = (known after apply)
                      + allow_headers        = (known after apply)
                      + allow_methods        = (known after apply)
                      + allow_origin_regexes = (known after apply)
                      + allow_origins        = (known after apply)
                      + disabled             = (known after apply)
                      + expose_headers       = (known after apply)
                      + max_age              = (known after apply)
                    }
                  + fault_injection_policy {
                      + abort {
                          + http_status = (known after apply)
                          + percentage  = (known after apply)
                        }
                      + delay {
                          + percentage = (known after apply)
                          + fixed_delay {
                              + nanos   = (known after apply)
                              + seconds = (known after apply)
                            }
                        }
                    }
                  + request_mirror_policy {
                      + backend_service = (known after apply)
                    }
                  + retry_policy {
                      + num_retries      = (known after apply)
                      + retry_conditions = (known after apply)
                      + per_try_timeout {
                          + nanos   = (known after apply)
                          + seconds = (known after apply)
                        }
                    }
                  + timeout {
                      + nanos   = (known after apply)
                      + seconds = (known after apply)
                    }
                  + url_rewrite {
                      + host_rewrite        = (known after apply)
                      + path_prefix_rewrite = (known after apply)
                    }
                  + weighted_backend_services {
                      + backend_service = (known after apply)
                      + weight          = (known after apply)
                      + header_action {
                          + request_headers_to_remove  = (known after apply)
                          + response_headers_to_remove = (known after apply)
                          + request_headers_to_add {
                              + header_name  = (known after apply)
                              + header_value = (known after apply)
                              + replace      = (known after apply)
                            }
                          + response_headers_to_add {
                              + header_name  = (known after apply)
                              + header_value = (known after apply)
                              + replace      = (known after apply)
                            }
                        }
                    }
                }
              + url_redirect {
                  + host_redirect          = (known after apply)
                  + https_redirect         = (known after apply)
                  + path_redirect          = (known after apply)
                  + prefix_redirect        = (known after apply)
                  + redirect_response_code = (known after apply)
                  + strip_query            = (known after apply)
                }
            }
          - route_rules {
              - priority = 2 -> null
              - service  = "[REDACTED]" -> null
              - match_rules {
                  - ignore_case  = false -> null
                  - prefix_match = "/ravegeo" -> null
                }
            }
          - route_rules {
              - priority = 3 -> null
              - match_rules {
                  - ignore_case  = false -> null
                  - prefix_match = "/geo-admin" -> null
                }
              - url_redirect {
                  - https_redirect  = true -> null
                  - prefix_redirect = "/ravegeo/admin" -> null
                  - strip_query     = false -> null
                }
            }
        }
        # (1 unchanged block hidden)
    }
```
*note: i've redacted some of the service urls and project-id*. 

This doesnt look right to me (so we never applied). 
If we 'hardcode' the service in as the fourth route rule then it works as intended. 

Also the second example, with the dynamic handling 3 services and the 1 hardcoded route rule. That also produces the same plan output. 